app/services/checkout_processor.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ?   [["id", 11]]
SELECT "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "customers" SET "province_id" = ?, "first_name" = ?, "last_name" = ?, "phone" = ?, "address" = ?, "city" = ?, "updated_at" = ? WHERE "customers"."id" = ?
INSERT INTO "orders" ("user_id", "status", "delivery_method", "subtotal", "gst_amount", "pst_amount", "hst_amount", "delivery_fee", "total", "recipient_name", "phone", "address", "city", "postal_code", "province_name", "gst_rate", "pst_rate", "hst_rate", "created_at", "updated_at", "customer_id", "stripe_checkout_session_id", "stripe_payment_intent_id", "paid_at", "shipped_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def call
    raise EmptyCartError, "Your cart is empty." if @cart.blank?

    ActiveRecord::Base.transaction do
      products = Product.lock.where(id: @cart.keys).index_by { |product| product.id.to_s }
      validate_products!(products)

      @customer = @authenticated_customer || Customer.find_or_initialize_by(
        email: @customer_attributes.fetch(:email).to_s.strip.downcase
      )
      @customer.assign_attributes(@customer_attributes)
      @customer.save!

      order = build_order(products)
      order.save!

INSERT INTO "order_items" ("order_id", "product_id", "product_name", "sku", "quantity", "unit_price", "line_total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create_order_items!(order, products)
    @cart.each do |product_id, quantity|
      product = products.fetch(product_id.to_s)
      unit_price = product.selling_price
      order.order_items.create!(
        product: product,
        product_name: product.name,
        sku: product.sku,
        quantity: quantity,
        unit_price: unit_price,
        line_total: unit_price * quantity.to_i
      )

UPDATE "products" SET "stock_quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock_quantity", 7], ["updated_at", "2026-07-28 14:32:00.622776"], ["id", 11]]
---
  def reduce_inventory!(products)
    @cart.each do |product_id, quantity|
      product = products.fetch(product_id.to_s)
      product.update!(stock_quantity: product.stock_quantity - quantity.to_i)