app/views/devise/registrations/edit.html.erb

          <%= form.label :province_id, "Province or territory" %>
          <%= form.collection_select :province_id, Province.order(:name), :id, :name, {}, required: true %>
---
SELECT "provinces".* FROM "provinces" ORDER BY "provinces"."name" ASC