app/views/devise/registrations/new.html.erb

SELECT "provinces".* FROM "provinces" ORDER BY "provinces"."name" ASC
---
          <%= form.label :province_id, "Province or territory" %>
          <%= form.collection_select :province_id, Province.order(:name), :id, :name,
            { prompt: "Select a province or territory" },
            { required: true, autocomplete: "address-level1" } %>