app/admin/dashboard.rb

SELECT COUNT(*) FROM "products"
SELECT COUNT(*) FROM "products" WHERE "products"."active" = ?  [["active", 1]]
SELECT COUNT(*) FROM "products" WHERE (stock_quantity <= ?)  [[nil, 10]]
SELECT COUNT(*) FROM "site_pages"
---

    div class: "admin-stats" do
      div class: "admin-stat" do
        strong Product.count
        span "Products"
      end
      div class: "admin-stat" do
        strong Product.where(active: true).count
        span "Active products"
      end
      div class: "admin-stat" do
        strong Product.where("stock_quantity <= ?", 10).count
        span "Low-stock items"
      end
      div class: "admin-stat" do
        strong SitePage.count

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 3], ["id", 5]]
SELECT "products".* FROM "products" WHERE (stock_quantity <= ?) ORDER BY "products"."stock_quantity" ASC LIMIT ?  [[nil, 10], ["LIMIT", 8]]
---
    div class: "admin-dashboard-grid" do
      div do
        panel "Low-stock products" do
          table_for Product.includes(:category).where("stock_quantity <= ?", 10).order(:stock_quantity).limit(8) do