app/admin/orders.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
---
    end

    panel "Products ordered" do
      table_for order.order_items do