app/admin/products.rb

SELECT "categories"."name", "categories"."id" FROM "categories" ORDER BY "categories"."name" ASC
---

  includes :category, image_attachment: :blob

  filter :category,
    as: :select,
    collection: -> { Category.order(:name).pluck(:name, :id) },
    include_blank: "All categories"