app/views/orders/index.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (?, ?)  [["order_id", 4], ["order_id", 3]]
---
          <div class="order-history-products">
            <% order.order_items.each do |item| %>