app/controllers/carts_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 6], ["id", 5]]
---
  def show
    cart = session_cart
    products = Product.available
      .includes(:category, image_attachment: :blob)
      .where(id: cart.keys)
      .index_by { |product| product.id.to_s }