app/controllers/categories_controller.rb

  def index
    @categories = Category.joins(:products)
      .merge(Product.where(active: true))
      .distinct
      .order(:name)
    @product_counts = Product.where(active: true, category_id: @categories.select(:id))
      .group(:category_id)
      .count
---
SELECT DISTINCT "categories".* FROM "categories" INNER JOIN "products" ON "products"."category_id" = "categories"."id" WHERE "products"."active" = ? ORDER BY "categories"."name" ASC  [["active", 1]]
SELECT COUNT(*) AS "count_all", "products"."category_id" AS "products_category_id" FROM "products" WHERE "products"."active" = ? AND "products"."category_id" IN (SELECT DISTINCT "categories"."id" FROM "categories" INNER JOIN "products" ON "products"."category_id" = "categories"."id" WHERE "products"."active" = ? ORDER BY "categories"."name" ASC) GROUP BY "products"."category_id"  [["active", 1], ["active", 1]]

  def show
    @category = Category.find(params[:id])
    @products = @category.products
      .includes(image_attachment: :blob)
      .where(active: true)
      .order(:name)
      .page(params[:page])
      .per(6)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ? AND "products"."active" = ? ORDER BY "products"."name" ASC LIMIT ? OFFSET ?  [["category_id", 3], ["active", 1], ["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = ? AND "products"."active" = ?  [["category_id", 3], ["active", 1]]