app/controllers/checkouts_controller.rb

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    @customer = current_customer || Customer.find_by(id: session[:customer_id]) || Customer.new

INSERT INTO "orders" ("user_id", "status", "delivery_method", "subtotal", "gst_amount", "pst_amount", "hst_amount", "delivery_fee", "total", "recipient_name", "phone", "address", "city", "postal_code", "province_name", "gst_rate", "pst_rate", "hst_rate", "created_at", "updated_at", "customer_id", "stripe_checkout_session_id", "stripe_payment_intent_id", "paid_at", "shipped_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
UPDATE "orders" SET "updated_at" = ?, "stripe_checkout_session_id" = ? WHERE "orders"."id" = ?  [["updated_at", "2026-08-10 00:11:14.340966"], ["stripe_checkout_session_id", "cs_test_order_1"], ["id", 1]]
---
  def create
    order = nil
    attributes = customer_params.to_h.symbolize_keys
    attributes[:email] = current_customer.email if customer_signed_in?
    processor = CheckoutProcessor.new(
      cart: session_cart,
      customer_attributes: attributes,
      customer: current_customer
    )
    order = processor.call

    if stripe_checkout_enabled?
      stripe_session = StripeCheckoutSession.create(
        order: order,
        success_url: "#{payment_success_url(order)}?session_id={CHECKOUT_SESSION_ID}",
        cancel_url: payment_cancel_url(order)
      )
      order.update!(stripe_checkout_session_id: stripe_session.id)

SELECT "provinces".* FROM "provinces" ORDER BY "provinces"."name" ASC
---
  def load_provinces
    @provinces = Province.order(:name)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?   [["id", 6], ["LIMIT", 1]]
---
  def load_cart_preview
    products = Product.available.where(id: session_cart.keys).index_by { |product| product.id.to_s }