app/controllers/home_controller.rb

  def index
    @products = Product.includes(:category, image_attachment: :blob).where(active: true).limit(6)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "products".* FROM "products" WHERE "products"."active" = ? AND (stock_quantity > 0) ORDER BY "products"."updated_at" DESC LIMIT ?  [["active", 1], ["LIMIT", 6]]