app/controllers/orders_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (?, ?)  [["order_id", 4], ["order_id", 3]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ? ORDER BY "orders"."created_at" DESC LIMIT ? OFFSET ?  [["customer_id", 3], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @orders = current_customer.orders
      .includes(:order_items)
      .order(created_at: :desc)
      .page(params[:page])
      .per(10)

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ?  [["id", 3]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    permitted_order_ids = Array(session[:completed_order_ids]).map(&:to_i)
    @order = Order.includes(:customer, :order_items).find(params[:id])

    customer_owns_order = customer_signed_in? && @order.customer_id == current_customer.id
    return if customer_owns_order || permitted_order_ids.include?(@order.id)