app/controllers/payments_controller.rb

  def load_accessible_order
    @order = Order.find(params[:order_id])
    permitted_order_ids = Array(session[:completed_order_ids]).map(&:to_i)
    customer_owns_order = customer_signed_in? && @order.customer_id == current_customer.id
    return if customer_owns_order || permitted_order_ids.include?(@order.id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]