app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."active" = ? AND (stock_quantity > 0) AND (LOWER(products.name) LIKE ? OR LOWER(products.description) LIKE ?) AND "products"."updated_at" BETWEEN ? AND ? AND (created_at < ?) ORDER BY "products"."name" ASC LIMIT ? OFFSET ?
---
  def index
    @products = Product.includes(:category, image_attachment: :blob).where(active: true).order(:name)