app/controllers/products_controller.rb

  def index
    @keyword = params[:keyword].to_s.strip
    @selected_category_id = params[:category_id].presence
    @categories = Category.order(:name)

    products = Product.includes(:category, image_attachment: :blob)
      .where(active: true)
      .search_by_keyword(@keyword)
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Networking"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?, ?, ?, ?)  [["id", 5], ["id", 3], ["id", 1], ["id", 6], ["id", 2], ["id", 4]]

  def show
    @product = Product.includes(:category, image_attachment: :blob).find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ?  [["id", 6]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]