app/controllers/site_pages_controller.rb

SELECT "site_pages".* FROM "site_pages" WHERE "site_pages"."slug" = ? LIMIT ?  [["slug", "about"], ["LIMIT", 1]]
---
  def show
    @site_page = SitePage.find_by!(slug: params[:slug])