app/models/order.rb

UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "cancelled"], ["updated_at", "2026-08-10 01:38:40.521737"], ["id", 5]]
UPDATE "products" SET "stock_quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock_quantity", 13], ["updated_at", "2026-08-10 01:38:40.512042"], ["id", 6]]
---
  def cancel_and_release_inventory!
    with_lock do
      return unless new_order?

      order_items.includes(:product).each do |item|
        item.product.with_lock do
          item.product.update!(stock_quantity: item.product.stock_quantity + item.quantity)